InformationRegisters/Лео_РеестПервичныхДокументов/Лео_РеестПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_РеестПервичныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОбщийСтатусПервичныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийАкт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСчетФактура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПрочиеДокументы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДоговор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДатаАкт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДатаСчетФаатура</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДатаПрочиеДокументы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДатаДоговор</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоДатаКО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_РеестПервичныхДокументов/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСтатусыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ОбновитьСтатусыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыДокумента()
	ТекущееСостояние = ПолучитьТекущееСостояние (ЭтаФорма.Запись.Документ,Запись.Период);
	
	Если НЕ ТекущееСостояние = Неопределено Тогда 
		//ЭтаФорма.Элементы.ТекущийСтатусАкта. =  ТекущееСостояние[0].КомментарийАкт;
		ТекущийСтатусАкта =  ТекущееСостояние[0].КомментарийАкт;
        ТекущийСтатусСчетФактура =  ТекущееСостояние[0].КомментарийСчетФактура;
        ТекущийСтатусПрочиеДокументы =  ТекущееСостояние[0].КомментарийПрочиеДокументы;
        ТекущийСтатусДоговор =  ТекущееСостояние[0].КомментарийДоговор; 
		// {Лео Катанович по письму Глуховой С.Л. 18/07/2016
		ТекущийСтатусКО =  ТекущееСостояние[0].КомментарийКО; 
        // Лео Катанович по письму Глуховой С.Л. 18/07/2016}

		Запись.ОбщийСтатусПервичныхДокументов  =  ТекущееСостояние[0].ОбщийСтатусПервичныхДокументов; 
		Если Запись.КомментарийАкт = "" Тогда 
			Запись.ИнфоДатаАкт = ТекущееСостояние[0].ИнфоДатаАкт;
			Запись.КомментарийАкт = ТекущееСостояние[0].КомментарийАкт;
		КонецЕсли; 
		Если Запись.КомментарийДоговор = "" Тогда 
			Запись.ИнфоДатаДоговор = ТекущееСостояние[0].ИнфоДатаДоговор;
			Запись.КомментарийДоговор =  ТекущееСостояние[0].КомментарийДоговор;
		КонецЕсли;
		Если Запись.КомментарийПрочиеДокументы = "" Тогда
			Запись.ИнфоДатаПрочиеДокументы = ТекущееСостояние[0].ИнфоДатаПрочиеДокументы;
			Запись.КомментарийПрочиеДокументы = ТекущееСостояние[0].КомментарийПрочиеДокументы;
		КонецЕсли;
		Если Запись.КомментарийСчетФактура = "" Тогда
			Запись.ИнфоДатаСчетФаатура = ТекущееСостояние[0].ИнфоДатаСчетФаатура;
			Запись.КомментарийСчетФактура = ТекущееСостояние[0].КомментарийСчетФактура;
		КонецЕсли;
		// {Лео Катанович по письму Глуховой С.Л. 18/07/2016
		Если Запись.КомментарийКО = "" Тогда
			Запись.ИнфоДатаКО = ТекущееСостояние[0].ИнфоДатаКО;
			Запись.КомментарийКО = ТекущееСостояние[0].КомментарийКО;
		КонецЕсли;
        // Лео Катанович по письму Глуховой С.Л. 18/07/2016}

	Иначе
		Запись.ИнфоДатаАкт = ТекущаяДата();
		Запись.ИнфоДатаДоговор = ТекущаяДата();
		Запись.ИнфоДатаПрочиеДокументы = ТекущаяДата();
		Запись.ИнфоДатаСчетФаатура = ТекущаяДата();
		// {Лео Катанович по письму Глуховой С.Л. 18/07/2016
		Запись.ИнфоДатаКО = ТекущаяДата();
		// Лео Катанович по письму Глуховой С.Л. 18/07/2016}


	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущееСостояние (ДокументСсылка,ДатаСреза)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_РеестПервичныхДокументовСрезПоследних.КомментарийАкт,
		|	Лео_РеестПервичныхДокументовСрезПоследних.КомментарийСчетФактура,
		|	Лео_РеестПервичныхДокументовСрезПоследних.КомментарийПрочиеДокументы,
		|	Лео_РеестПервичныхДокументовСрезПоследних.КомментарийДоговор,
		|	Лео_РеестПервичныхДокументовСрезПоследних.ОбщийСтатусПервичныхДокументов,
		|	Лео_РеестПервичныхДокументовСрезПоследних.ИнфоДатаАкт,
		|	Лео_РеестПервичныхДокументовСрезПоследних.ИнфоДатаСчетФаатура,
		|	Лео_РеестПервичныхДокументовСрезПоследних.ИнфоДатаПрочиеДокументы,
		|	Лео_РеестПервичныхДокументовСрезПоследних.ИнфоДатаДоговор,
		// {Лео Катанович по письму Глуховой С.Л. 18/07/2016
		|	Лео_РеестПервичныхДокументовСрезПоследних.ИнфоДатаКО,
		|	Лео_РеестПервичныхДокументовСрезПоследних.КомментарийКО
		// Лео Катанович по письму Глуховой С.Л. 18/07/2016}
		|ИЗ
		|	РегистрСведений.Лео_РеестПервичныхДокументов.СрезПоследних(&Дата, ) КАК Лео_РеестПервичныхДокументовСрезПоследних
		|ГДЕ
		|	Лео_РеестПервичныхДокументовСрезПоследних.Документ = &ДокументСсылка";

	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Дата", ДатаСреза -1);

	Результат = Запрос.Выполнить();

	ТекущееСостояние = Результат.Выгрузить();

	Если ТекущееСостояние.Количество() > 0 Тогда
		Возврат ТекущееСостояние
		
	Иначе
		Возврат Неопределено
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ПриИзмененииКомментариев()
	Если Запись.КомментарийАкт  = "" и Запись.КомментарийДоговор = "" и Запись.КомментарийПрочиеДокументы = "" и  Запись.КомментарийСчетФактура = "" Тогда
		Запись.ОбщийСтатусПервичныхДокументов = Ложь;
	Иначе
		Запись.ОбщийСтатусПервичныхДокументов = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийАктПриИзменении(Элемент)
	ПриИзмененииКомментариев();
	Запись.ИнфоДатаАкт = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСчетФактураПриИзменении(Элемент)
	ПриИзмененииКомментариев();
	Запись.ИнфоДатаСчетФаатура = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура КомментарийПрочиеДокументыПриИзменении(Элемент)
	ПриИзмененииКомментариев();
	Запись.ИнфоДатаПрочиеДокументы = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийДоговорПриИзменении(Элемент)
	ПриИзмененииКомментариев();
	Запись.ИнфоДатаДоговор = ТекущаяДата();
КонецПроцедуры

// {Лео Катанович по письму Глуховой С.Л. 18/07/2016
&НаКлиенте
Процедура КомментарийКОПриИзменении(Элемент)
	ПриИзмененииКомментариев();
	Запись.ИнфоДатаКО = ТекущаяДата();
КонецПроцедуры
// Лео Катанович по письму Глуховой С.Л. 18/07/2016}
